In [27]:
import pandas as pd

df = pd.read_csv("GlobalLandTemperaturesByCountry.csv")
print(df.dtypes)
print(df.shape)
print(df.describe())

dt                                object
AverageTemperature               float64
AverageTemperatureUncertainty    float64
Country                           object
dtype: object
(577462, 4)
       AverageTemperature  AverageTemperatureUncertainty
count       544811.000000                  545550.000000
mean            17.193354                       1.019057
std             10.953966                       1.201930
min            -37.658000                       0.052000
25%             10.025000                       0.323000
50%             20.901000                       0.571000
75%             25.814000                       1.206000
max             38.842000                      15.003000

In [21]:
df.isna().sum()

dt                                   0
AverageTemperature               32651
AverageTemperatureUncertainty    31912
Country                              0
dtype: int64

In [17]:
droped_df = df.dropna(inplace=False)
droped_df

,dt,AverageTemperature,AverageTemperatureUncertainty,Country
0,1743-11-01,4.384,2.294,Åland
5,1744-04-01,1.530,4.680,Åland
6,1744-05-01,6.702,1.789,Åland
7,1744-06-01,11.609,1.577,Åland
8,1744-07-01,15.342,1.410,Åland
...,...,...,...,...
577456,2013-04-01,21.142,0.495,Zimbabwe
577457,2013-05-01,19.059,1.022,Zimbabwe
577458,2013-06-01,17.613,0.473,Zimbabwe
577459,2013-07-01,17.000,0.453,Zimbabwe
577460,2013-08-01,19.759,0.717,Zimbabwe

In [ ]:
moving_avg = df.select_dtypes("number").rolling(60,min_periods=1,center=True).mean()
filled_df = df.fillna(moving_avg ,inplace=False)
filled_df

,dt,AverageTemperature,AverageTemperatureUncertainty,Country
0,1743-11-01,4.384000,2.294000,Åland
1,1743-12-01,3.260462,1.829308,Åland
2,1744-01-01,3.260462,1.829308,Åland
3,1744-02-01,3.260462,1.829308,Åland
4,1744-03-01,3.260462,1.829308,Åland
...,...,...,...,...
577457,2013-05-01,19.059000,1.022000,Zimbabwe
577458,2013-06-01,17.613000,0.473000,Zimbabwe
577459,2013-07-01,17.000000,0.453000,Zimbabwe
577460,2013-08-01,19.759000,0.717000,Zimbabwe
577461,2013-09-01,21.234100,0.556367,Zimbabwe

. افزودن ستون Decade :
تبدیل سالها به دههها. به عنوان مثال، سال 1980 به “ 1980s

In [92]:
filled_df.dt = pd.to_datetime(filled_df.dt)
filled_df["Decade"] = (filled_df.dt.dt.year // 10 * 10).astype(str) + "s"
filled_df

,dt,AverageTemperature,AverageTemperatureUncertainty,Country,Decade
0,1743-11-01,4.384000,2.294000,Åland,1740s
1,1743-12-01,3.260462,1.829308,Åland,1740s
2,1744-01-01,3.260462,1.829308,Åland,1740s
3,1744-02-01,3.260462,1.829308,Åland,1740s
4,1744-03-01,3.260462,1.829308,Åland,1740s
...,...,...,...,...,...
577457,2013-05-01,19.059000,1.022000,Zimbabwe,2010s
577458,2013-06-01,17.613000,0.473000,Zimbabwe,2010s
577459,2013-07-01,17.000000,0.453000,Zimbabwe,2010s
577460,2013-08-01,19.759000,0.717000,Zimbabwe,2010s
577461,2013-09-01,21.234100,0.556367,Zimbabwe,2010s

نگهداری فقط کشورهایی که حداقل 100 سال داده دارند.

In [93]:
year_count = filled_df.groupby("Country").dt.agg(lambda x: max(x).year-min(x).year)
# year_count = pd.to_datetime(year_count.max().dt) - pd.to_datetime(year_count.min().dt)
print(year_count[year_count<=100])
filtered_countries = filled_df[filled_df["Country"].isin(year_count[year_count>100].index.tolist())]
filtered_countries
# print(filtered_countries[filtered_countries.Country == "Antarctica"])

Country
Antarctica                             63
French Southern And Antarctic Lands    65
Heard Island And Mcdonald Islands      65
Name: dt, dtype: int64

,dt,AverageTemperature,AverageTemperatureUncertainty,Country,Decade
0,1743-11-01,4.384000,2.294000,Åland,1740s
1,1743-12-01,3.260462,1.829308,Åland,1740s
2,1744-01-01,3.260462,1.829308,Åland,1740s
3,1744-02-01,3.260462,1.829308,Åland,1740s
4,1744-03-01,3.260462,1.829308,Åland,1740s
...,...,...,...,...,...
577457,2013-05-01,19.059000,1.022000,Zimbabwe,2010s
577458,2013-06-01,17.613000,0.473000,Zimbabwe,2010s
577459,2013-07-01,17.000000,0.453000,Zimbabwe,2010s
577460,2013-08-01,19.759000,0.717000,Zimbabwe,2010s
577461,2013-09-01,21.234100,0.556367,Zimbabwe,2010s

محاسبه میانگین دما برای هر دهه و ساخت ماتریس decade × temperature anomaly .

In [116]:
grouped = filtered_countries.groupby(["Country","Decade"]).mean(numeric_only=True)
grouped

                    AverageTemperature  AverageTemperatureUncertainty
Country     Decade
Afghanistan 1830s            14.061109                       2.096855
            1840s            13.658134                       2.321985
            1850s            13.557317                       2.210167
            1860s            13.477967                       2.295258
            1870s            13.845850                       1.860758
...                                ...                            ...
Åland       1970s             5.600417                       0.417550
            1980s             5.366067                       0.414550
            1990s             6.295967                       0.408675
            2000s             6.816300                       0.347475
            2010s             6.163151                       0.438150

[5054 rows x 2 columns]

استفاده از np.polyfit )( برای محاسبه خط روند دما.

In [125]:
import numpy as np
import matplotlib.pyplot as plt

decades = grouped.loc["Afghanistan"].index
temps   = grouped.loc["Afghanistan"]["AverageTemperature"]

x_numeric = np.array([int(dec[:-1]) + 5 for dec in decades])
polyfit = np.polyfit(x_numeric, temps, 1)
polyfit

array([ 0.00810777, -1.52339932])

محاسبه نرخ گرمایش بر حسب ° C بر دهه.

In [128]:
print(f"slope: {polyfit[0]}")

slope: 0.008107769282079598

خوشبینانه: کاهش ۳0٪ نرخ

In [148]:
print(f"last year : {temps.last_valid_index()}")
print(f"last year temp : {temps[temps.last_valid_index()]}")
temp2050with30per_dec = temps[temps.last_valid_index()] * (1 + slope * 0.7 * (2050-2010)/10)
temp2050 = temps[temps.last_valid_index()] * (1 + slope * (2050-2010)/10)
temp2050with50per_inc = temps[temps.last_valid_index()] * (1 + slope * 1.5 * (2050-2010)/10)
print(f"temp2050with30per_dec : {temp2050with30per_dec}")
print(f"temp2050 : {temp2050}")
print(f"temp2050with50per_inc : {temp2050with50per_inc}")

last year : 2010s
last year temp : 15.565465040650405
temp2050with30per_dec : 15.91882839874044
temp2050 : 16.070269837921884
temp2050with50per_inc : 16.322672236557622